---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.StructuralConnectionType
source: html/28cdab23-ebf7-3ddf-77f6-6572827b5c30.htm
---
# StructuralConnectionType Properties

Choose whether this connection type applies to beams and
 braces, to tops of columns, or to bases of columns.